SettingHelp = {}
SettingHelp.HelpText =  [[快捷键说明
F1到F8   可以自设置的技能快捷键
F9       打开/关闭包裹窗口
F10      打开/关闭角色窗口
F11      打开/关闭角色技能窗口
F12      打开/关闭辅助功能窗口
Alt+X    返回到角色选择界面
Alt+Q    直接退出游戏
Pause    在游戏中截图保存在游戏\Images目录下面 
Ctrl+B   打开/关闭商铺窗口
Ctrl+M   骑马或下马
Ctrl+H   选择自己喜欢的攻击模式：
    和平攻击模式 - 对任何玩家攻击都无效
    行会攻击模式 - 对自己行会内的其他玩家攻击无效
    编组攻击模式 - 处于同一小组的玩家攻击无效
    全体攻击模式 - 对所有的玩家都具有攻击效果
    善恶攻击模式 - PK红名专用攻击模式
特殊命令说明
    /玩家名字     私聊
    !交流文字     喊话
    !!文字        组队聊天
    !~文字        行会聊天
    上下方向键    查看过去的聊天信息
    @拒绝私聊     拒绝所有的私人聊天的命令
    @拒绝+人名    对特定的某一个人聊天文字进行屏蔽 
    @拒绝行会聊天 屏蔽行会聊天所有消息的命令 
    @退出门派     脱离行会 
快速编组说明
    鼠标点中要组队的角色同时按ALT+W即可自动和该角色组队，再次
    按ALT+E即可自动把该角色从队伍中删除
英雄操作快捷键
    Ctrl+E  切换英雄三中状态：跟随、休息、战斗 
    Ctrl+Q  启动/关闭英雄“守护”状态
    Ctrl+W  指定英雄攻击鼠标点中的目标
    Ctrl+S  释放合击技能
其他快捷键
    CTRL+Z        显示物品名称. 
    TAB           切换小地图.
    Alt+W         快速组队
    Alt+R         刷新背包
    Alt+鼠标右键  快速复制人名.
    M键           显示自动寻路窗口
    Esc键         关闭所有窗口
连击操作快捷键
    Ctrl+D 释放连击技能]]
function SettingHelp.main()
    local parent = GUI:Attach_Parent()

end
